cases/Bent_pipe_Shape_Effect/Shape_1/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

activeSpecies
(
    Water
);

inactiveSpecies
(
    Air
);

inertSpecie Air;

phaseMixing
{
    viscosity       continuousPhase;
    conductivity    continuousPhase;
    heatCapacity    continuousPhase;
}
