cases/Bent_pipe_Shape_Effect/Shape_1/system/functionObject2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This routine is to check mass balance across inlet, outlet and intermediate cutting planes, the face zone has been created using topoSet

functions
{

    avgParticleFlux
    {

        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;

	writeControl     timeStep;
	writeInterval    1;

        log              true;

        writeFields     false;

        regionType      all;
        name            inlet;

	operation        average;
        fields
        (
            M.01
            M.02
            M.03
            M.04
            M.05
            M.06
            M.07
            M.08
            M.09
            M.10
            M.11
            M.12
            M.13
            M.14
            M.15    
            M.16        

        );
    }



}








